<?php
/*=====================================================
/ 自動販売機インデックス（購入画面）
/=====================================================*/

// 設定ファイル読み込み
require_once './conf/const.php';
// 関数ファイル読み込み
require_once './model/M_function.php';


$err_msg = []; //DBエラー用
$drink_data = [];


//------------------------------------------------------------
// DBに接続
//------------------------------------------------------------
try {
  // DB接続
  $dbh = get_db_connect();
  
  // DB接続情報が取得できていれば
  if (empty($dbh) === FALSE){

    //------------------------------------------------------------
    // 商品一覧を取得
    //------------------------------------------------------------
    $drink_data = get_drinks_table_list($dbh);
    
    if (empty($drink_data) === FALSE) {
        // 特殊文字をHTMLエンティティに変換
        $drink_data = entity_assoc_array($drink_data);
    }
  }
} catch (Exception $e) {
  $err_msg[] = $e->getMessage();
}


/*=====================================================*/
// 購入画面テンプレートファイル読み込み
include_once './view/V_index.php';


?>